# Export IFCCategory Info Class

Source: https://www.revitapidocs.com/2026/5da998a3-e973-3b76-5f5d-ed4769fef46e.htm

---

| Export IFCCategory Info Class |
| --- |

Represents the mapped IFC information stored in the template. Inheritance Hierarchy System Object
Autodesk.Revit.DB ExportIFCCategoryInfo

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class ExportIFCCategoryInfo : IDisposable
```

```
Public Class ExportIFCCategoryInfo
	Implements IDisposable
```

```
public ref class ExportIFCCategoryInfo : IDisposable
```

```
type ExportIFCCategoryInfo =
    class
        interface IDisposable
    end
```
The ExportIFCCategoryInfo type exposes the following members.

Constructors

|  | Name | Description |
| --- | --- | --- |
|  | ExportIFCCategoryInfo | Constructs a new ExportIFCCategoryInfo with default values. |
|  | ExportIFCCategoryInfo(Boolean, String, String, String, String) | Constructs a new ExportIFCCategoryInfo with input values. |

Top Properties

|  | Name | Description |
| --- | --- | --- |
|  | IFCEntityName | The name of the IFC entity mapped to a particular Revit category. |
|  | IFCExportFlag | The boolean value that indicates whether the category is exported to IFC. |
|  | IFCPredefinedType | The name of the predefined type mapped to a particular Revit category. |
|  | IFCPresentationLayerName | The name of the presentation layer mapped to a particular Revit category. |
|  | IFCUserDefinedType | The name of the user\-defined type mapped to a particular Revit category. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExportIFCCategoryInfo |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | IsDefault | Determines if a ExportIFCCategoryInfo contains default information. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace